package first_semester.lesson2.examples;

/*
* Сигнатура любого исполняемого кода будет выглядеть так.
* Пока что советую просто принять это как константу и не пытаться копнуть глубже.
* Глубже мы копнем далее.
*
* Пока что нужно знать несколько вещей.
* Обязательно:
* - Если открыл фигурную скобку "{" - не забудь закрыть "}"
* - Если открыл круглу скобку "(" - не забудь закрыть ")"
* - Думаю, что делать с квадратными скобками понятно с:
* - Если строка не заканчивается фигурной скобкой "}" , то скорее всего надо поставить ";"
* - Название файла должно соответствовать названию класса
 */

public class HelloWorld {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}